zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_LPE_XRDC.h
/*
 * Copyright 1997-2016 Freescale Semiconductor, Inc.
 * Copyright 2016-2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/*!
 * @file S32K566_LPE_XRDC.h
 * @version 2.2
 * @date 2025-10-16
 * @brief Peripheral Access Layer for S32K566_LPE_XRDC
 *
 * This file contains register definitions and macros for easy access to their
 * bit fields.
 *
 * This file assumes LITTLE endian system.
 */

/**
* @page misra_violations MISRA-C:2012 violations
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.3, local typedef not referenced
* The SoC header defines typedef for all modules.
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.5, local macro not referenced
* The SoC header defines macros for all modules and registers.
*
* @section [global]
* Violates MISRA 2012 Advisory Directive 4.9, Function-like macro
* These are generated macros used for accessing the bit-fields from registers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.1, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.2, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.4, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.5, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 21.1, defined macro '__I' is reserved to the compiler
* This type qualifier is needed to ensure correct I/O access and addressing.
*/

/* Prevention from multiple including the same memory map */
#if !defined(S32K566_LPE_XRDC_H_)  /* Check if memory map has not been already included */
#define S32K566_LPE_XRDC_H_

#include "S32K566_COMMON.h"

/* ----------------------------------------------------------------------------
   -- LPE_XRDC Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup LPE_XRDC_Peripheral_Access_Layer LPE_XRDC Peripheral Access Layer
 * @{
 */

/** LPE_XRDC - Size of Registers Arrays */
#define LPE_XRDC_MDAC_COUNT                       2u
#define LPE_XRDC_MRC_COUNT                        1u
#define LPE_XRDC_DERRLOC_COUNT                    16u
#define LPE_XRDC_DERRW0_COUNT                     19u
#define LPE_XRDC_PID_COUNT                        1u
#define LPE_XRDC_PDAC_SLOT_PDACN_COUNT            108u
#define LPE_XRDC_PDAC_SLOT_COUNT                  3u
#define LPE_XRDC_MRCN_COUNT                       1u
#define LPE_XRDC_MRCN_MRGDN_COUNT                 16u

/** LPE_XRDC - Register Layout Typedef */
typedef struct LPE_XRDC_Struct {
  __IO uint32_t CR;                                /**< Control, offset: 0x0 */
  uint8_t RESERVED_0[236];
  __I  uint32_t HWCFG0;                            /**< Hardware Configuration 0, offset: 0xF0 */
  __I  uint32_t HWCFG1;                            /**< Hardware Configuration 1, offset: 0xF4 */
  __I  uint32_t HWCFG2;                            /**< Hardware Configuration 2, offset: 0xF8 */
  uint8_t RESERVED_1[4];
  __I  uint8_t MDACFG[LPE_XRDC_MDAC_COUNT];        /**< Master Domain Assignment Configuration, array offset: 0x100, array step: 0x1 */
  uint8_t RESERVED_2[62];
  __I  uint8_t MRCFG[LPE_XRDC_MRC_COUNT];          /**< Memory Region Configuration, array offset: 0x140, array step: 0x1 */
  uint8_t RESERVED_3[191];
  __I  uint32_t DERRLOC[LPE_XRDC_DERRLOC_COUNT];   /**< Domain Error Location, array offset: 0x200, array step: 0x4 */
  uint8_t RESERVED_4[448];
  struct LPE_XRDC_DERRW0 {                         /* offset: 0x400, array step: 0x10 */
    __I  uint32_t DERR_W0;                           /**< Domain Error Word 0, array offset: 0x400, array step: 0x10, valid indices: [0, 16-18] */
    __I  uint32_t DERR_W1;                           /**< Domain Error Word 1, array offset: 0x404, array step: 0x10, valid indices: [0, 16-18] */
    uint8_t RESERVED_0[4];
    __IO uint32_t DERR_W3;                           /**< Domain Error Word 3, array offset: 0x40C, array step: 0x10, valid indices: [0, 16-18] */
  } DERRW0[LPE_XRDC_DERRW0_COUNT];
  uint8_t RESERVED_5[464];
  __IO uint32_t PID[LPE_XRDC_PID_COUNT];           /**< Process Identifier, array offset: 0x700, array step: 0x4 */
  uint8_t RESERVED_6[252];
  __IO uint32_t MDA_W0_0_DFMT0;                    /**< Master Domain Assignment, offset: 0x800 */
  __IO uint32_t MDA_W1_0_DFMT0;                    /**< Master Domain Assignment, offset: 0x804 */
  __IO uint32_t MDA_W2_0_DFMT0;                    /**< Master Domain Assignment, offset: 0x808 */
  __IO uint32_t MDA_W3_0_DFMT0;                    /**< Master Domain Assignment, offset: 0x80C */
  uint8_t RESERVED_7[16];
  __IO uint32_t MDA_W0_1_DFMT1;                    /**< Master Domain Assignment, offset: 0x820 */
  uint8_t RESERVED_8[2012];
  struct LPE_XRDC_PDAC_SLOT {                      /* offset: 0x1000, array step: 0x400 */
    struct LPE_XRDC_PDAC_SLOT_PDACN {                /* offset: 0x1000, array step: index*0x400, index2*0x8 */
      __IO uint32_t PDAC_W0;                           /**< Peripheral Domain Access Control Word 0, array offset: 0x1000, array step: index*0x400, index2*0x8, irregular array, not all indices are valid */
      __IO uint32_t PDAC_W1;                           /**< Peripheral Domain Access Control Word 1, array offset: 0x1004, array step: index*0x400, index2*0x8, irregular array, not all indices are valid */
    } PDACN[LPE_XRDC_PDAC_SLOT_PDACN_COUNT];
    uint8_t RESERVED_0[160];
  } PDAC_SLOT[LPE_XRDC_PDAC_SLOT_COUNT];
  uint8_t RESERVED_9[1024];
  struct LPE_XRDC_MRGDN {                          /* offset: 0x2000, array step: index*0x200, index2*0x20 */
    __IO uint32_t XRDC_MRGD_W0;                      /**< Memory Region Descriptor Word 0, array offset: 0x2000, array step: index*0x200, index2*0x20 */
    __IO uint32_t XRDC_MRGD_W1;                      /**< Memory Region Descriptor Word 1, array offset: 0x2004, array step: index*0x200, index2*0x20 */
    __IO uint32_t XRDC_MRGD_W2;                      /**< Memory Region Descriptor Word 2, array offset: 0x2008, array step: index*0x200, index2*0x20 */
    __IO uint32_t XRDC_MRGD_W3;                      /**< Memory Region Descriptor Word 3, array offset: 0x200C, array step: index*0x200, index2*0x20 */
    uint8_t RESERVED_0[16];
  } MRGDN[LPE_XRDC_MRCN_COUNT][LPE_XRDC_MRCN_MRGDN_COUNT];
} LPE_XRDC_Type, *LPE_XRDC_MemMapPtr;

