zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_LPE_XRDC.h
/** Number of instances of the LPE_XRDC module. */
#define LPE_XRDC_INSTANCE_COUNT                  (1u)

/* LPE_XRDC - Peripheral instance base addresses */
/** Peripheral LPE_XRDC base address */
#define IP_LPE_XRDC_BASE                         (0x4203C000u)
/** Peripheral LPE_XRDC base pointer */
#define IP_LPE_XRDC                              ((LPE_XRDC_Type *)IP_LPE_XRDC_BASE)
/** Array initializer of LPE_XRDC peripheral base addresses */
#define IP_LPE_XRDC_BASE_ADDRS                   { IP_LPE_XRDC_BASE }
/** Array initializer of LPE_XRDC peripheral base pointers */
#define IP_LPE_XRDC_BASE_PTRS                    { IP_LPE_XRDC }

/* ----------------------------------------------------------------------------
   -- LPE_XRDC Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup LPE_XRDC_Register_Masks LPE_XRDC Register Masks
 * @{
 */

/*! @name CR - Control */
/*! @{ */

#define LPE_XRDC_CR_GVLD_MASK                    (0x1U)
#define LPE_XRDC_CR_GVLD_SHIFT                   (0U)
#define LPE_XRDC_CR_GVLD_WIDTH                   (1U)
#define LPE_XRDC_CR_GVLD(x)                      (((uint32_t)(((uint32_t)(x)) << LPE_XRDC_CR_GVLD_SHIFT)) & LPE_XRDC_CR_GVLD_MASK)

#define LPE_XRDC_CR_HRL_MASK                     (0x1EU)
#define LPE_XRDC_CR_HRL_SHIFT                    (1U)
#define LPE_XRDC_CR_HRL_WIDTH                    (4U)
#define LPE_XRDC_CR_HRL(x)                       (((uint32_t)(((uint32_t)(x)) << LPE_XRDC_CR_HRL_SHIFT)) & LPE_XRDC_CR_HRL_MASK)

#define LPE_XRDC_CR_MRF_MASK                     (0x80U)
#define LPE_XRDC_CR_MRF_SHIFT                    (7U)
#define LPE_XRDC_CR_MRF_WIDTH                    (1U)
#define LPE_XRDC_CR_MRF(x)                       (((uint32_t)(((uint32_t)(x)) << LPE_XRDC_CR_MRF_SHIFT)) & LPE_XRDC_CR_MRF_MASK)

#define LPE_XRDC_CR_VAW_MASK                     (0x100U)
#define LPE_XRDC_CR_VAW_SHIFT                    (8U)
#define LPE_XRDC_CR_VAW_WIDTH                    (1U)
#define LPE_XRDC_CR_VAW(x)                       (((uint32_t)(((uint32_t)(x)) << LPE_XRDC_CR_VAW_SHIFT)) & LPE_XRDC_CR_VAW_MASK)

#define LPE_XRDC_CR_LK1_MASK                     (0x40000000U)
#define LPE_XRDC_CR_LK1_SHIFT                    (30U)
#define LPE_XRDC_CR_LK1_WIDTH                    (1U)
#define LPE_XRDC_CR_LK1(x)                       (((uint32_t)(((uint32_t)(x)) << LPE_XRDC_CR_LK1_SHIFT)) & LPE_XRDC_CR_LK1_MASK)
/*! @} */

/*! @name HWCFG0 - Hardware Configuration 0 */
/*! @{ */

#define LPE_XRDC_HWCFG0_NDID_MASK                (0xFFU)
#define LPE_XRDC_HWCFG0_NDID_SHIFT               (0U)
#define LPE_XRDC_HWCFG0_NDID_WIDTH               (8U)
#define LPE_XRDC_HWCFG0_NDID(x)                  (((uint32_t)(((uint32_t)(x)) << LPE_XRDC_HWCFG0_NDID_SHIFT)) & LPE_XRDC_HWCFG0_NDID_MASK)

#define LPE_XRDC_HWCFG0_NMSTR_MASK               (0xFF00U)
#define LPE_XRDC_HWCFG0_NMSTR_SHIFT              (8U)
#define LPE_XRDC_HWCFG0_NMSTR_WIDTH              (8U)
#define LPE_XRDC_HWCFG0_NMSTR(x)                 (((uint32_t)(((uint32_t)(x)) << LPE_XRDC_HWCFG0_NMSTR_SHIFT)) & LPE_XRDC_HWCFG0_NMSTR_MASK)

#define LPE_XRDC_HWCFG0_NMRC_MASK                (0xFF0000U)
#define LPE_XRDC_HWCFG0_NMRC_SHIFT               (16U)
#define LPE_XRDC_HWCFG0_NMRC_WIDTH               (8U)
#define LPE_XRDC_HWCFG0_NMRC(x)                  (((uint32_t)(((uint32_t)(x)) << LPE_XRDC_HWCFG0_NMRC_SHIFT)) & LPE_XRDC_HWCFG0_NMRC_MASK)

#define LPE_XRDC_HWCFG0_NPAC_MASK                (0xF000000U)
#define LPE_XRDC_HWCFG0_NPAC_SHIFT               (24U)
#define LPE_XRDC_HWCFG0_NPAC_WIDTH               (4U)
#define LPE_XRDC_HWCFG0_NPAC(x)                  (((uint32_t)(((uint32_t)(x)) << LPE_XRDC_HWCFG0_NPAC_SHIFT)) & LPE_XRDC_HWCFG0_NPAC_MASK)

#define LPE_XRDC_HWCFG0_MID_MASK                 (0xF0000000U)
#define LPE_XRDC_HWCFG0_MID_SHIFT                (28U)
#define LPE_XRDC_HWCFG0_MID_WIDTH                (4U)
#define LPE_XRDC_HWCFG0_MID(x)                   (((uint32_t)(((uint32_t)(x)) << LPE_XRDC_HWCFG0_MID_SHIFT)) & LPE_XRDC_HWCFG0_MID_MASK)
/*! @} */

/*! @name HWCFG1 - Hardware Configuration 1 */
/*! @{ */

#define LPE_XRDC_HWCFG1_DID_MASK                 (0xFU)
#define LPE_XRDC_HWCFG1_DID_SHIFT                (0U)
#define LPE_XRDC_HWCFG1_DID_WIDTH                (4U)
#define LPE_XRDC_HWCFG1_DID(x)                   (((uint32_t)(((uint32_t)(x)) << LPE_XRDC_HWCFG1_DID_SHIFT)) & LPE_XRDC_HWCFG1_DID_MASK)
/*! @} */

/*! @name HWCFG2 - Hardware Configuration 2 */
/*! @{ */

#define LPE_XRDC_HWCFG2_PIDP0_MASK               (0x1U)
#define LPE_XRDC_HWCFG2_PIDP0_SHIFT              (0U)
#define LPE_XRDC_HWCFG2_PIDP0_WIDTH              (1U)
#define LPE_XRDC_HWCFG2_PIDP0(x)                 (((uint32_t)(((uint32_t)(x)) << LPE_XRDC_HWCFG2_PIDP0_SHIFT)) & LPE_XRDC_HWCFG2_PIDP0_MASK)

#define LPE_XRDC_HWCFG2_PIDP1_MASK               (0x2U)
#define LPE_XRDC_HWCFG2_PIDP1_SHIFT              (1U)
#define LPE_XRDC_HWCFG2_PIDP1_WIDTH              (1U)
#define LPE_XRDC_HWCFG2_PIDP1(x)                 (((uint32_t)(((uint32_t)(x)) << LPE_XRDC_HWCFG2_PIDP1_SHIFT)) & LPE_XRDC_HWCFG2_PIDP1_MASK)

#define LPE_XRDC_HWCFG2_PIDP2_MASK               (0x4U)
#define LPE_XRDC_HWCFG2_PIDP2_SHIFT              (2U)
#define LPE_XRDC_HWCFG2_PIDP2_WIDTH              (1U)
#define LPE_XRDC_HWCFG2_PIDP2(x)                 (((uint32_t)(((uint32_t)(x)) << LPE_XRDC_HWCFG2_PIDP2_SHIFT)) & LPE_XRDC_HWCFG2_PIDP2_MASK)

#define LPE_XRDC_HWCFG2_PIDP3_MASK               (0x8U)
#define LPE_XRDC_HWCFG2_PIDP3_SHIFT              (3U)
#define LPE_XRDC_HWCFG2_PIDP3_WIDTH              (1U)
#define LPE_XRDC_HWCFG2_PIDP3(x)                 (((uint32_t)(((uint32_t)(x)) << LPE_XRDC_HWCFG2_PIDP3_SHIFT)) & LPE_XRDC_HWCFG2_PIDP3_MASK)

#define LPE_XRDC_HWCFG2_PIDP4_MASK               (0x10U)
#define LPE_XRDC_HWCFG2_PIDP4_SHIFT              (4U)
#define LPE_XRDC_HWCFG2_PIDP4_WIDTH              (1U)
#define LPE_XRDC_HWCFG2_PIDP4(x)                 (((uint32_t)(((uint32_t)(x)) << LPE_XRDC_HWCFG2_PIDP4_SHIFT)) & LPE_XRDC_HWCFG2_PIDP4_MASK)

