zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_LPE_XRDC.h
#define LPE_XRDC_HWCFG2_PIDP5_MASK               (0x20U)
#define LPE_XRDC_HWCFG2_PIDP5_SHIFT              (5U)
#define LPE_XRDC_HWCFG2_PIDP5_WIDTH              (1U)
#define LPE_XRDC_HWCFG2_PIDP5(x)                 (((uint32_t)(((uint32_t)(x)) << LPE_XRDC_HWCFG2_PIDP5_SHIFT)) & LPE_XRDC_HWCFG2_PIDP5_MASK)

#define LPE_XRDC_HWCFG2_PIDP6_MASK               (0x40U)
#define LPE_XRDC_HWCFG2_PIDP6_SHIFT              (6U)
#define LPE_XRDC_HWCFG2_PIDP6_WIDTH              (1U)
#define LPE_XRDC_HWCFG2_PIDP6(x)                 (((uint32_t)(((uint32_t)(x)) << LPE_XRDC_HWCFG2_PIDP6_SHIFT)) & LPE_XRDC_HWCFG2_PIDP6_MASK)

#define LPE_XRDC_HWCFG2_PIDP7_MASK               (0x80U)
#define LPE_XRDC_HWCFG2_PIDP7_SHIFT              (7U)
#define LPE_XRDC_HWCFG2_PIDP7_WIDTH              (1U)
#define LPE_XRDC_HWCFG2_PIDP7(x)                 (((uint32_t)(((uint32_t)(x)) << LPE_XRDC_HWCFG2_PIDP7_SHIFT)) & LPE_XRDC_HWCFG2_PIDP7_MASK)

#define LPE_XRDC_HWCFG2_PIDP8_MASK               (0x100U)
#define LPE_XRDC_HWCFG2_PIDP8_SHIFT              (8U)
#define LPE_XRDC_HWCFG2_PIDP8_WIDTH              (1U)
#define LPE_XRDC_HWCFG2_PIDP8(x)                 (((uint32_t)(((uint32_t)(x)) << LPE_XRDC_HWCFG2_PIDP8_SHIFT)) & LPE_XRDC_HWCFG2_PIDP8_MASK)

#define LPE_XRDC_HWCFG2_PIDP9_MASK               (0x200U)
#define LPE_XRDC_HWCFG2_PIDP9_SHIFT              (9U)
#define LPE_XRDC_HWCFG2_PIDP9_WIDTH              (1U)
#define LPE_XRDC_HWCFG2_PIDP9(x)                 (((uint32_t)(((uint32_t)(x)) << LPE_XRDC_HWCFG2_PIDP9_SHIFT)) & LPE_XRDC_HWCFG2_PIDP9_MASK)

#define LPE_XRDC_HWCFG2_PIDP10_MASK              (0x400U)
#define LPE_XRDC_HWCFG2_PIDP10_SHIFT             (10U)
#define LPE_XRDC_HWCFG2_PIDP10_WIDTH             (1U)
#define LPE_XRDC_HWCFG2_PIDP10(x)                (((uint32_t)(((uint32_t)(x)) << LPE_XRDC_HWCFG2_PIDP10_SHIFT)) & LPE_XRDC_HWCFG2_PIDP10_MASK)

#define LPE_XRDC_HWCFG2_PIDP11_MASK              (0x800U)
#define LPE_XRDC_HWCFG2_PIDP11_SHIFT             (11U)
#define LPE_XRDC_HWCFG2_PIDP11_WIDTH             (1U)
#define LPE_XRDC_HWCFG2_PIDP11(x)                (((uint32_t)(((uint32_t)(x)) << LPE_XRDC_HWCFG2_PIDP11_SHIFT)) & LPE_XRDC_HWCFG2_PIDP11_MASK)

#define LPE_XRDC_HWCFG2_PIDP12_MASK              (0x1000U)
#define LPE_XRDC_HWCFG2_PIDP12_SHIFT             (12U)
#define LPE_XRDC_HWCFG2_PIDP12_WIDTH             (1U)
#define LPE_XRDC_HWCFG2_PIDP12(x)                (((uint32_t)(((uint32_t)(x)) << LPE_XRDC_HWCFG2_PIDP12_SHIFT)) & LPE_XRDC_HWCFG2_PIDP12_MASK)

#define LPE_XRDC_HWCFG2_PIDP13_MASK              (0x2000U)
#define LPE_XRDC_HWCFG2_PIDP13_SHIFT             (13U)
#define LPE_XRDC_HWCFG2_PIDP13_WIDTH             (1U)
#define LPE_XRDC_HWCFG2_PIDP13(x)                (((uint32_t)(((uint32_t)(x)) << LPE_XRDC_HWCFG2_PIDP13_SHIFT)) & LPE_XRDC_HWCFG2_PIDP13_MASK)

#define LPE_XRDC_HWCFG2_PIDP14_MASK              (0x4000U)
#define LPE_XRDC_HWCFG2_PIDP14_SHIFT             (14U)
#define LPE_XRDC_HWCFG2_PIDP14_WIDTH             (1U)
#define LPE_XRDC_HWCFG2_PIDP14(x)                (((uint32_t)(((uint32_t)(x)) << LPE_XRDC_HWCFG2_PIDP14_SHIFT)) & LPE_XRDC_HWCFG2_PIDP14_MASK)

#define LPE_XRDC_HWCFG2_PIDP15_MASK              (0x8000U)
#define LPE_XRDC_HWCFG2_PIDP15_SHIFT             (15U)
#define LPE_XRDC_HWCFG2_PIDP15_WIDTH             (1U)
#define LPE_XRDC_HWCFG2_PIDP15(x)                (((uint32_t)(((uint32_t)(x)) << LPE_XRDC_HWCFG2_PIDP15_SHIFT)) & LPE_XRDC_HWCFG2_PIDP15_MASK)

#define LPE_XRDC_HWCFG2_PIDP16_MASK              (0x10000U)
#define LPE_XRDC_HWCFG2_PIDP16_SHIFT             (16U)
#define LPE_XRDC_HWCFG2_PIDP16_WIDTH             (1U)
#define LPE_XRDC_HWCFG2_PIDP16(x)                (((uint32_t)(((uint32_t)(x)) << LPE_XRDC_HWCFG2_PIDP16_SHIFT)) & LPE_XRDC_HWCFG2_PIDP16_MASK)

#define LPE_XRDC_HWCFG2_PIDP17_MASK              (0x20000U)
#define LPE_XRDC_HWCFG2_PIDP17_SHIFT             (17U)
#define LPE_XRDC_HWCFG2_PIDP17_WIDTH             (1U)
#define LPE_XRDC_HWCFG2_PIDP17(x)                (((uint32_t)(((uint32_t)(x)) << LPE_XRDC_HWCFG2_PIDP17_SHIFT)) & LPE_XRDC_HWCFG2_PIDP17_MASK)

#define LPE_XRDC_HWCFG2_PIDP18_MASK              (0x40000U)
#define LPE_XRDC_HWCFG2_PIDP18_SHIFT             (18U)
#define LPE_XRDC_HWCFG2_PIDP18_WIDTH             (1U)
#define LPE_XRDC_HWCFG2_PIDP18(x)                (((uint32_t)(((uint32_t)(x)) << LPE_XRDC_HWCFG2_PIDP18_SHIFT)) & LPE_XRDC_HWCFG2_PIDP18_MASK)

#define LPE_XRDC_HWCFG2_PIDP19_MASK              (0x80000U)
#define LPE_XRDC_HWCFG2_PIDP19_SHIFT             (19U)
#define LPE_XRDC_HWCFG2_PIDP19_WIDTH             (1U)
#define LPE_XRDC_HWCFG2_PIDP19(x)                (((uint32_t)(((uint32_t)(x)) << LPE_XRDC_HWCFG2_PIDP19_SHIFT)) & LPE_XRDC_HWCFG2_PIDP19_MASK)

#define LPE_XRDC_HWCFG2_PIDP20_MASK              (0x100000U)
#define LPE_XRDC_HWCFG2_PIDP20_SHIFT             (20U)
#define LPE_XRDC_HWCFG2_PIDP20_WIDTH             (1U)
#define LPE_XRDC_HWCFG2_PIDP20(x)                (((uint32_t)(((uint32_t)(x)) << LPE_XRDC_HWCFG2_PIDP20_SHIFT)) & LPE_XRDC_HWCFG2_PIDP20_MASK)

#define LPE_XRDC_HWCFG2_PIDP21_MASK              (0x200000U)
#define LPE_XRDC_HWCFG2_PIDP21_SHIFT             (21U)
#define LPE_XRDC_HWCFG2_PIDP21_WIDTH             (1U)
#define LPE_XRDC_HWCFG2_PIDP21(x)                (((uint32_t)(((uint32_t)(x)) << LPE_XRDC_HWCFG2_PIDP21_SHIFT)) & LPE_XRDC_HWCFG2_PIDP21_MASK)

#define LPE_XRDC_HWCFG2_PIDP22_MASK              (0x400000U)
#define LPE_XRDC_HWCFG2_PIDP22_SHIFT             (22U)
#define LPE_XRDC_HWCFG2_PIDP22_WIDTH             (1U)
#define LPE_XRDC_HWCFG2_PIDP22(x)                (((uint32_t)(((uint32_t)(x)) << LPE_XRDC_HWCFG2_PIDP22_SHIFT)) & LPE_XRDC_HWCFG2_PIDP22_MASK)

#define LPE_XRDC_HWCFG2_PIDP23_MASK              (0x800000U)
#define LPE_XRDC_HWCFG2_PIDP23_SHIFT             (23U)
#define LPE_XRDC_HWCFG2_PIDP23_WIDTH             (1U)
#define LPE_XRDC_HWCFG2_PIDP23(x)                (((uint32_t)(((uint32_t)(x)) << LPE_XRDC_HWCFG2_PIDP23_SHIFT)) & LPE_XRDC_HWCFG2_PIDP23_MASK)

#define LPE_XRDC_HWCFG2_PIDP24_MASK              (0x1000000U)
#define LPE_XRDC_HWCFG2_PIDP24_SHIFT             (24U)
#define LPE_XRDC_HWCFG2_PIDP24_WIDTH             (1U)
#define LPE_XRDC_HWCFG2_PIDP24(x)                (((uint32_t)(((uint32_t)(x)) << LPE_XRDC_HWCFG2_PIDP24_SHIFT)) & LPE_XRDC_HWCFG2_PIDP24_MASK)

