zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_LPE_XRDC.h
#define LPE_XRDC_HWCFG2_PIDP25_MASK              (0x2000000U)
#define LPE_XRDC_HWCFG2_PIDP25_SHIFT             (25U)
#define LPE_XRDC_HWCFG2_PIDP25_WIDTH             (1U)
#define LPE_XRDC_HWCFG2_PIDP25(x)                (((uint32_t)(((uint32_t)(x)) << LPE_XRDC_HWCFG2_PIDP25_SHIFT)) & LPE_XRDC_HWCFG2_PIDP25_MASK)

#define LPE_XRDC_HWCFG2_PIDP26_MASK              (0x4000000U)
#define LPE_XRDC_HWCFG2_PIDP26_SHIFT             (26U)
#define LPE_XRDC_HWCFG2_PIDP26_WIDTH             (1U)
#define LPE_XRDC_HWCFG2_PIDP26(x)                (((uint32_t)(((uint32_t)(x)) << LPE_XRDC_HWCFG2_PIDP26_SHIFT)) & LPE_XRDC_HWCFG2_PIDP26_MASK)

#define LPE_XRDC_HWCFG2_PIDP27_MASK              (0x8000000U)
#define LPE_XRDC_HWCFG2_PIDP27_SHIFT             (27U)
#define LPE_XRDC_HWCFG2_PIDP27_WIDTH             (1U)
#define LPE_XRDC_HWCFG2_PIDP27(x)                (((uint32_t)(((uint32_t)(x)) << LPE_XRDC_HWCFG2_PIDP27_SHIFT)) & LPE_XRDC_HWCFG2_PIDP27_MASK)

#define LPE_XRDC_HWCFG2_PIDP28_MASK              (0x10000000U)
#define LPE_XRDC_HWCFG2_PIDP28_SHIFT             (28U)
#define LPE_XRDC_HWCFG2_PIDP28_WIDTH             (1U)
#define LPE_XRDC_HWCFG2_PIDP28(x)                (((uint32_t)(((uint32_t)(x)) << LPE_XRDC_HWCFG2_PIDP28_SHIFT)) & LPE_XRDC_HWCFG2_PIDP28_MASK)

#define LPE_XRDC_HWCFG2_PIDP29_MASK              (0x20000000U)
#define LPE_XRDC_HWCFG2_PIDP29_SHIFT             (29U)
#define LPE_XRDC_HWCFG2_PIDP29_WIDTH             (1U)
#define LPE_XRDC_HWCFG2_PIDP29(x)                (((uint32_t)(((uint32_t)(x)) << LPE_XRDC_HWCFG2_PIDP29_SHIFT)) & LPE_XRDC_HWCFG2_PIDP29_MASK)

#define LPE_XRDC_HWCFG2_PIDP30_MASK              (0x40000000U)
#define LPE_XRDC_HWCFG2_PIDP30_SHIFT             (30U)
#define LPE_XRDC_HWCFG2_PIDP30_WIDTH             (1U)
#define LPE_XRDC_HWCFG2_PIDP30(x)                (((uint32_t)(((uint32_t)(x)) << LPE_XRDC_HWCFG2_PIDP30_SHIFT)) & LPE_XRDC_HWCFG2_PIDP30_MASK)

#define LPE_XRDC_HWCFG2_PIDP31_MASK              (0x80000000U)
#define LPE_XRDC_HWCFG2_PIDP31_SHIFT             (31U)
#define LPE_XRDC_HWCFG2_PIDP31_WIDTH             (1U)
#define LPE_XRDC_HWCFG2_PIDP31(x)                (((uint32_t)(((uint32_t)(x)) << LPE_XRDC_HWCFG2_PIDP31_SHIFT)) & LPE_XRDC_HWCFG2_PIDP31_MASK)
/*! @} */

/*! @name MDACFG - Master Domain Assignment Configuration */
/*! @{ */

#define LPE_XRDC_MDACFG_NMDAR_MASK               (0xFU)
#define LPE_XRDC_MDACFG_NMDAR_SHIFT              (0U)
#define LPE_XRDC_MDACFG_NMDAR_WIDTH              (4U)
#define LPE_XRDC_MDACFG_NMDAR(x)                 (((uint8_t)(((uint8_t)(x)) << LPE_XRDC_MDACFG_NMDAR_SHIFT)) & LPE_XRDC_MDACFG_NMDAR_MASK)

#define LPE_XRDC_MDACFG_NCM_MASK                 (0x80U)
#define LPE_XRDC_MDACFG_NCM_SHIFT                (7U)
#define LPE_XRDC_MDACFG_NCM_WIDTH                (1U)
#define LPE_XRDC_MDACFG_NCM(x)                   (((uint8_t)(((uint8_t)(x)) << LPE_XRDC_MDACFG_NCM_SHIFT)) & LPE_XRDC_MDACFG_NCM_MASK)
/*! @} */

/*! @name MRCFG - Memory Region Configuration */
/*! @{ */

#define LPE_XRDC_MRCFG_NMRGD_MASK                (0x1FU)
#define LPE_XRDC_MRCFG_NMRGD_SHIFT               (0U)
#define LPE_XRDC_MRCFG_NMRGD_WIDTH               (5U)
#define LPE_XRDC_MRCFG_NMRGD(x)                  (((uint8_t)(((uint8_t)(x)) << LPE_XRDC_MRCFG_NMRGD_SHIFT)) & LPE_XRDC_MRCFG_NMRGD_MASK)
/*! @} */

/*! @name DERRLOC - Domain Error Location */
/*! @{ */

#define LPE_XRDC_DERRLOC_MRCINST_MASK            (0xFFFFU)
#define LPE_XRDC_DERRLOC_MRCINST_SHIFT           (0U)
#define LPE_XRDC_DERRLOC_MRCINST_WIDTH           (16U)
#define LPE_XRDC_DERRLOC_MRCINST(x)              (((uint32_t)(((uint32_t)(x)) << LPE_XRDC_DERRLOC_MRCINST_SHIFT)) & LPE_XRDC_DERRLOC_MRCINST_MASK)

#define LPE_XRDC_DERRLOC_PACINST_MASK            (0xF0000U)
#define LPE_XRDC_DERRLOC_PACINST_SHIFT           (16U)
#define LPE_XRDC_DERRLOC_PACINST_WIDTH           (4U)
#define LPE_XRDC_DERRLOC_PACINST(x)              (((uint32_t)(((uint32_t)(x)) << LPE_XRDC_DERRLOC_PACINST_SHIFT)) & LPE_XRDC_DERRLOC_PACINST_MASK)
/*! @} */

/*! @name DERR_W0 - Domain Error Word 0 */
/*! @{ */

#define LPE_XRDC_DERR_W0_EADDR_MASK              (0xFFFFFFFFU)
#define LPE_XRDC_DERR_W0_EADDR_SHIFT             (0U)
#define LPE_XRDC_DERR_W0_EADDR_WIDTH             (32U)
#define LPE_XRDC_DERR_W0_EADDR(x)                (((uint32_t)(((uint32_t)(x)) << LPE_XRDC_DERR_W0_EADDR_SHIFT)) & LPE_XRDC_DERR_W0_EADDR_MASK)
/*! @} */

/*! @name DERR_W1 - Domain Error Word 1 */
/*! @{ */

#define LPE_XRDC_DERR_W1_EDID_MASK               (0xFU)
#define LPE_XRDC_DERR_W1_EDID_SHIFT              (0U)
#define LPE_XRDC_DERR_W1_EDID_WIDTH              (4U)
#define LPE_XRDC_DERR_W1_EDID(x)                 (((uint32_t)(((uint32_t)(x)) << LPE_XRDC_DERR_W1_EDID_SHIFT)) & LPE_XRDC_DERR_W1_EDID_MASK)

#define LPE_XRDC_DERR_W1_EATR_MASK               (0x700U)
#define LPE_XRDC_DERR_W1_EATR_SHIFT              (8U)
#define LPE_XRDC_DERR_W1_EATR_WIDTH              (3U)
#define LPE_XRDC_DERR_W1_EATR(x)                 (((uint32_t)(((uint32_t)(x)) << LPE_XRDC_DERR_W1_EATR_SHIFT)) & LPE_XRDC_DERR_W1_EATR_MASK)

#define LPE_XRDC_DERR_W1_ERW_MASK                (0x800U)
#define LPE_XRDC_DERR_W1_ERW_SHIFT               (11U)
#define LPE_XRDC_DERR_W1_ERW_WIDTH               (1U)
#define LPE_XRDC_DERR_W1_ERW(x)                  (((uint32_t)(((uint32_t)(x)) << LPE_XRDC_DERR_W1_ERW_SHIFT)) & LPE_XRDC_DERR_W1_ERW_MASK)

#define LPE_XRDC_DERR_W1_EPORT_MASK              (0x7000000U)
#define LPE_XRDC_DERR_W1_EPORT_SHIFT             (24U)
#define LPE_XRDC_DERR_W1_EPORT_WIDTH             (3U)
#define LPE_XRDC_DERR_W1_EPORT(x)                (((uint32_t)(((uint32_t)(x)) << LPE_XRDC_DERR_W1_EPORT_SHIFT)) & LPE_XRDC_DERR_W1_EPORT_MASK)

#define LPE_XRDC_DERR_W1_EST_MASK                (0xC0000000U)
#define LPE_XRDC_DERR_W1_EST_SHIFT               (30U)
#define LPE_XRDC_DERR_W1_EST_WIDTH               (2U)
#define LPE_XRDC_DERR_W1_EST(x)                  (((uint32_t)(((uint32_t)(x)) << LPE_XRDC_DERR_W1_EST_SHIFT)) & LPE_XRDC_DERR_W1_EST_MASK)
/*! @} */

/*! @name DERR_W3 - Domain Error Word 3 */
/*! @{ */

#define LPE_XRDC_DERR_W3_RECR_MASK               (0xC0000000U)
#define LPE_XRDC_DERR_W3_RECR_SHIFT              (30U)
#define LPE_XRDC_DERR_W3_RECR_WIDTH              (2U)
#define LPE_XRDC_DERR_W3_RECR(x)                 (((uint32_t)(((uint32_t)(x)) << LPE_XRDC_DERR_W3_RECR_SHIFT)) & LPE_XRDC_DERR_W3_RECR_MASK)
/*! @} */

/*! @name PID - Process Identifier */
/*! @{ */

#define LPE_XRDC_PID_PID_MASK                    (0x3FU)
#define LPE_XRDC_PID_PID_SHIFT                   (0U)
#define LPE_XRDC_PID_PID_WIDTH                   (6U)
#define LPE_XRDC_PID_PID(x)                      (((uint32_t)(((uint32_t)(x)) << LPE_XRDC_PID_PID_SHIFT)) & LPE_XRDC_PID_PID_MASK)

#define LPE_XRDC_PID_TSM_MASK                    (0x10000000U)
#define LPE_XRDC_PID_TSM_SHIFT                   (28U)
#define LPE_XRDC_PID_TSM_WIDTH                   (1U)
#define LPE_XRDC_PID_TSM(x)                      (((uint32_t)(((uint32_t)(x)) << LPE_XRDC_PID_TSM_SHIFT)) & LPE_XRDC_PID_TSM_MASK)

#define LPE_XRDC_PID_LK2_MASK                    (0x60000000U)
#define LPE_XRDC_PID_LK2_SHIFT                   (29U)
#define LPE_XRDC_PID_LK2_WIDTH                   (2U)
#define LPE_XRDC_PID_LK2(x)                      (((uint32_t)(((uint32_t)(x)) << LPE_XRDC_PID_LK2_SHIFT)) & LPE_XRDC_PID_LK2_MASK)
/*! @} */

/*! @name MDA_W0_0_DFMT0 - Master Domain Assignment */
/*! @{ */

#define LPE_XRDC_MDA_W0_0_DFMT0_DID_MASK         (0xFU)
#define LPE_XRDC_MDA_W0_0_DFMT0_DID_SHIFT        (0U)
#define LPE_XRDC_MDA_W0_0_DFMT0_DID_WIDTH        (4U)
#define LPE_XRDC_MDA_W0_0_DFMT0_DID(x)           (((uint32_t)(((uint32_t)(x)) << LPE_XRDC_MDA_W0_0_DFMT0_DID_SHIFT)) & LPE_XRDC_MDA_W0_0_DFMT0_DID_MASK)

#define LPE_XRDC_MDA_W0_0_DFMT0_DIDS_MASK        (0x30U)
#define LPE_XRDC_MDA_W0_0_DFMT0_DIDS_SHIFT       (4U)
#define LPE_XRDC_MDA_W0_0_DFMT0_DIDS_WIDTH       (2U)
#define LPE_XRDC_MDA_W0_0_DFMT0_DIDS(x)          (((uint32_t)(((uint32_t)(x)) << LPE_XRDC_MDA_W0_0_DFMT0_DIDS_SHIFT)) & LPE_XRDC_MDA_W0_0_DFMT0_DIDS_MASK)

