zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_LPE_XRDC.h
#define LPE_XRDC_MDA_W0_0_DFMT0_PE_MASK          (0xC0U)
#define LPE_XRDC_MDA_W0_0_DFMT0_PE_SHIFT         (6U)
#define LPE_XRDC_MDA_W0_0_DFMT0_PE_WIDTH         (2U)
#define LPE_XRDC_MDA_W0_0_DFMT0_PE(x)            (((uint32_t)(((uint32_t)(x)) << LPE_XRDC_MDA_W0_0_DFMT0_PE_SHIFT)) & LPE_XRDC_MDA_W0_0_DFMT0_PE_MASK)

#define LPE_XRDC_MDA_W0_0_DFMT0_PIDM_MASK        (0x3F00U)
#define LPE_XRDC_MDA_W0_0_DFMT0_PIDM_SHIFT       (8U)
#define LPE_XRDC_MDA_W0_0_DFMT0_PIDM_WIDTH       (6U)
#define LPE_XRDC_MDA_W0_0_DFMT0_PIDM(x)          (((uint32_t)(((uint32_t)(x)) << LPE_XRDC_MDA_W0_0_DFMT0_PIDM_SHIFT)) & LPE_XRDC_MDA_W0_0_DFMT0_PIDM_MASK)

#define LPE_XRDC_MDA_W0_0_DFMT0_PID_MASK         (0x3F0000U)
#define LPE_XRDC_MDA_W0_0_DFMT0_PID_SHIFT        (16U)
#define LPE_XRDC_MDA_W0_0_DFMT0_PID_WIDTH        (6U)
#define LPE_XRDC_MDA_W0_0_DFMT0_PID(x)           (((uint32_t)(((uint32_t)(x)) << LPE_XRDC_MDA_W0_0_DFMT0_PID_SHIFT)) & LPE_XRDC_MDA_W0_0_DFMT0_PID_MASK)

#define LPE_XRDC_MDA_W0_0_DFMT0_DFMT_MASK        (0x20000000U)
#define LPE_XRDC_MDA_W0_0_DFMT0_DFMT_SHIFT       (29U)
#define LPE_XRDC_MDA_W0_0_DFMT0_DFMT_WIDTH       (1U)
#define LPE_XRDC_MDA_W0_0_DFMT0_DFMT(x)          (((uint32_t)(((uint32_t)(x)) << LPE_XRDC_MDA_W0_0_DFMT0_DFMT_SHIFT)) & LPE_XRDC_MDA_W0_0_DFMT0_DFMT_MASK)

#define LPE_XRDC_MDA_W0_0_DFMT0_LK1_MASK         (0x40000000U)
#define LPE_XRDC_MDA_W0_0_DFMT0_LK1_SHIFT        (30U)
#define LPE_XRDC_MDA_W0_0_DFMT0_LK1_WIDTH        (1U)
#define LPE_XRDC_MDA_W0_0_DFMT0_LK1(x)           (((uint32_t)(((uint32_t)(x)) << LPE_XRDC_MDA_W0_0_DFMT0_LK1_SHIFT)) & LPE_XRDC_MDA_W0_0_DFMT0_LK1_MASK)

#define LPE_XRDC_MDA_W0_0_DFMT0_VLD_MASK         (0x80000000U)
#define LPE_XRDC_MDA_W0_0_DFMT0_VLD_SHIFT        (31U)
#define LPE_XRDC_MDA_W0_0_DFMT0_VLD_WIDTH        (1U)
#define LPE_XRDC_MDA_W0_0_DFMT0_VLD(x)           (((uint32_t)(((uint32_t)(x)) << LPE_XRDC_MDA_W0_0_DFMT0_VLD_SHIFT)) & LPE_XRDC_MDA_W0_0_DFMT0_VLD_MASK)
/*! @} */

/*! @name MDA_W1_0_DFMT0 - Master Domain Assignment */
/*! @{ */

#define LPE_XRDC_MDA_W1_0_DFMT0_DID_MASK         (0xFU)
#define LPE_XRDC_MDA_W1_0_DFMT0_DID_SHIFT        (0U)
#define LPE_XRDC_MDA_W1_0_DFMT0_DID_WIDTH        (4U)
#define LPE_XRDC_MDA_W1_0_DFMT0_DID(x)           (((uint32_t)(((uint32_t)(x)) << LPE_XRDC_MDA_W1_0_DFMT0_DID_SHIFT)) & LPE_XRDC_MDA_W1_0_DFMT0_DID_MASK)

#define LPE_XRDC_MDA_W1_0_DFMT0_DIDS_MASK        (0x30U)
#define LPE_XRDC_MDA_W1_0_DFMT0_DIDS_SHIFT       (4U)
#define LPE_XRDC_MDA_W1_0_DFMT0_DIDS_WIDTH       (2U)
#define LPE_XRDC_MDA_W1_0_DFMT0_DIDS(x)          (((uint32_t)(((uint32_t)(x)) << LPE_XRDC_MDA_W1_0_DFMT0_DIDS_SHIFT)) & LPE_XRDC_MDA_W1_0_DFMT0_DIDS_MASK)

#define LPE_XRDC_MDA_W1_0_DFMT0_PE_MASK          (0xC0U)
#define LPE_XRDC_MDA_W1_0_DFMT0_PE_SHIFT         (6U)
#define LPE_XRDC_MDA_W1_0_DFMT0_PE_WIDTH         (2U)
#define LPE_XRDC_MDA_W1_0_DFMT0_PE(x)            (((uint32_t)(((uint32_t)(x)) << LPE_XRDC_MDA_W1_0_DFMT0_PE_SHIFT)) & LPE_XRDC_MDA_W1_0_DFMT0_PE_MASK)

#define LPE_XRDC_MDA_W1_0_DFMT0_PIDM_MASK        (0x3F00U)
#define LPE_XRDC_MDA_W1_0_DFMT0_PIDM_SHIFT       (8U)
#define LPE_XRDC_MDA_W1_0_DFMT0_PIDM_WIDTH       (6U)
#define LPE_XRDC_MDA_W1_0_DFMT0_PIDM(x)          (((uint32_t)(((uint32_t)(x)) << LPE_XRDC_MDA_W1_0_DFMT0_PIDM_SHIFT)) & LPE_XRDC_MDA_W1_0_DFMT0_PIDM_MASK)

#define LPE_XRDC_MDA_W1_0_DFMT0_PID_MASK         (0x3F0000U)
#define LPE_XRDC_MDA_W1_0_DFMT0_PID_SHIFT        (16U)
#define LPE_XRDC_MDA_W1_0_DFMT0_PID_WIDTH        (6U)
#define LPE_XRDC_MDA_W1_0_DFMT0_PID(x)           (((uint32_t)(((uint32_t)(x)) << LPE_XRDC_MDA_W1_0_DFMT0_PID_SHIFT)) & LPE_XRDC_MDA_W1_0_DFMT0_PID_MASK)

#define LPE_XRDC_MDA_W1_0_DFMT0_DFMT_MASK        (0x20000000U)
#define LPE_XRDC_MDA_W1_0_DFMT0_DFMT_SHIFT       (29U)
#define LPE_XRDC_MDA_W1_0_DFMT0_DFMT_WIDTH       (1U)
#define LPE_XRDC_MDA_W1_0_DFMT0_DFMT(x)          (((uint32_t)(((uint32_t)(x)) << LPE_XRDC_MDA_W1_0_DFMT0_DFMT_SHIFT)) & LPE_XRDC_MDA_W1_0_DFMT0_DFMT_MASK)

#define LPE_XRDC_MDA_W1_0_DFMT0_LK1_MASK         (0x40000000U)
#define LPE_XRDC_MDA_W1_0_DFMT0_LK1_SHIFT        (30U)
#define LPE_XRDC_MDA_W1_0_DFMT0_LK1_WIDTH        (1U)
#define LPE_XRDC_MDA_W1_0_DFMT0_LK1(x)           (((uint32_t)(((uint32_t)(x)) << LPE_XRDC_MDA_W1_0_DFMT0_LK1_SHIFT)) & LPE_XRDC_MDA_W1_0_DFMT0_LK1_MASK)

#define LPE_XRDC_MDA_W1_0_DFMT0_VLD_MASK         (0x80000000U)
#define LPE_XRDC_MDA_W1_0_DFMT0_VLD_SHIFT        (31U)
#define LPE_XRDC_MDA_W1_0_DFMT0_VLD_WIDTH        (1U)
#define LPE_XRDC_MDA_W1_0_DFMT0_VLD(x)           (((uint32_t)(((uint32_t)(x)) << LPE_XRDC_MDA_W1_0_DFMT0_VLD_SHIFT)) & LPE_XRDC_MDA_W1_0_DFMT0_VLD_MASK)
/*! @} */

/*! @name MDA_W2_0_DFMT0 - Master Domain Assignment */
/*! @{ */

#define LPE_XRDC_MDA_W2_0_DFMT0_DID_MASK         (0xFU)
#define LPE_XRDC_MDA_W2_0_DFMT0_DID_SHIFT        (0U)
#define LPE_XRDC_MDA_W2_0_DFMT0_DID_WIDTH        (4U)
#define LPE_XRDC_MDA_W2_0_DFMT0_DID(x)           (((uint32_t)(((uint32_t)(x)) << LPE_XRDC_MDA_W2_0_DFMT0_DID_SHIFT)) & LPE_XRDC_MDA_W2_0_DFMT0_DID_MASK)

#define LPE_XRDC_MDA_W2_0_DFMT0_DIDS_MASK        (0x30U)
#define LPE_XRDC_MDA_W2_0_DFMT0_DIDS_SHIFT       (4U)
#define LPE_XRDC_MDA_W2_0_DFMT0_DIDS_WIDTH       (2U)
#define LPE_XRDC_MDA_W2_0_DFMT0_DIDS(x)          (((uint32_t)(((uint32_t)(x)) << LPE_XRDC_MDA_W2_0_DFMT0_DIDS_SHIFT)) & LPE_XRDC_MDA_W2_0_DFMT0_DIDS_MASK)

#define LPE_XRDC_MDA_W2_0_DFMT0_PE_MASK          (0xC0U)
#define LPE_XRDC_MDA_W2_0_DFMT0_PE_SHIFT         (6U)
#define LPE_XRDC_MDA_W2_0_DFMT0_PE_WIDTH         (2U)
#define LPE_XRDC_MDA_W2_0_DFMT0_PE(x)            (((uint32_t)(((uint32_t)(x)) << LPE_XRDC_MDA_W2_0_DFMT0_PE_SHIFT)) & LPE_XRDC_MDA_W2_0_DFMT0_PE_MASK)

#define LPE_XRDC_MDA_W2_0_DFMT0_PIDM_MASK        (0x3F00U)
#define LPE_XRDC_MDA_W2_0_DFMT0_PIDM_SHIFT       (8U)
#define LPE_XRDC_MDA_W2_0_DFMT0_PIDM_WIDTH       (6U)
#define LPE_XRDC_MDA_W2_0_DFMT0_PIDM(x)          (((uint32_t)(((uint32_t)(x)) << LPE_XRDC_MDA_W2_0_DFMT0_PIDM_SHIFT)) & LPE_XRDC_MDA_W2_0_DFMT0_PIDM_MASK)

#define LPE_XRDC_MDA_W2_0_DFMT0_PID_MASK         (0x3F0000U)
#define LPE_XRDC_MDA_W2_0_DFMT0_PID_SHIFT        (16U)
#define LPE_XRDC_MDA_W2_0_DFMT0_PID_WIDTH        (6U)
#define LPE_XRDC_MDA_W2_0_DFMT0_PID(x)           (((uint32_t)(((uint32_t)(x)) << LPE_XRDC_MDA_W2_0_DFMT0_PID_SHIFT)) & LPE_XRDC_MDA_W2_0_DFMT0_PID_MASK)

#define LPE_XRDC_MDA_W2_0_DFMT0_DFMT_MASK        (0x20000000U)
#define LPE_XRDC_MDA_W2_0_DFMT0_DFMT_SHIFT       (29U)
#define LPE_XRDC_MDA_W2_0_DFMT0_DFMT_WIDTH       (1U)
#define LPE_XRDC_MDA_W2_0_DFMT0_DFMT(x)          (((uint32_t)(((uint32_t)(x)) << LPE_XRDC_MDA_W2_0_DFMT0_DFMT_SHIFT)) & LPE_XRDC_MDA_W2_0_DFMT0_DFMT_MASK)

